In [1]:
import pandas as pd
import numpy as np

In [6]:
age = np.random.randint(10,100,15)

In [7]:
age

array([54, 59, 35, 26, 96, 47, 73, 66, 76, 94, 60, 91, 38, 90, 81])

In [8]:
s = pd.Series(age) #column view

In [11]:
s.head()

0    54
1    59
2    35
3    26
4    96
dtype: int64

In [14]:
s.tail()

10    60
11    91
12    38
13    90
14    81
dtype: int64

In [15]:
s[0]

np.int64(54)

In [16]:
s[0:5]

0    54
1    59
2    35
3    26
4    96
dtype: int64

In [17]:
data = {
    "scores":np.random.randint(20,120,8),
    "names": np.array(['Sachin','Dhoni','Kohli','Yuvraj','Rohit','Rahul','Rishabh','Shikhar']),
    "catches":np.array([12,10,5,3,2,1,0,0]),
    "average":np.array([45.5,55.5,65.5,75.5,85.5,95.5,105.5,115.5])
}

In [18]:
#Data Frame - Tabular View - Table
df = pd.DataFrame(data)

In [19]:
df

   scores    names  catches  average
0      34   Sachin       12     45.5
1      81    Dhoni       10     55.5
2     105    Kohli        5     65.5
3      67   Yuvraj        3     75.5
4      71    Rohit        2     85.5
5      82    Rahul        1     95.5
6      97  Rishabh        0    105.5
7      70  Shikhar        0    115.5

In [21]:
df.tail()

   scores    names  catches  average
3      67   Yuvraj        3     75.5
4      71    Rohit        2     85.5
5      82    Rahul        1     95.5
6      97  Rishabh        0    105.5
7      70  Shikhar        0    115.5

In [22]:
df[df['catches']>=5]

   scores   names  catches  average
0      34  Sachin       12     45.5
1      81   Dhoni       10     55.5
2     105   Kohli        5     65.5

In [23]:
df[df['catches']>=5][['names','average']]

    names  average
0  Sachin     45.5
1   Dhoni     55.5
2   Kohli     65.5